; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-86)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 - object)
 (:init 
    (arm-empty)
    (clear b23)
    (on b23 b15)
    (on b15 b24)
    (on-table b24)
    (clear b6)
    (on b6 b7)
    (on b7 b4)
    (on b4 b19)
    (on b19 b11)
    (on b11 b20)
    (on b20 b13)
    (on b13 b10)
    (on b10 b3)
    (on b3 b5)
    (on b5 b2)
    (on b2 b17)
    (on b17 b22)
    (on b22 b14)
    (on b14 b8)
    (on b8 b12)
    (on-table b12)
    (clear b18)
    (on-table b18)
    (clear b16)
    (on b16 b25)
    (on b25 b9)
    (on-table b9)
    (clear b21)
    (on b21 b1)
    (on-table b1))
 (:goal (and 
(on-table b24)
(on b25 b11)
))
)

; plan
1. (unstack b6 b7)
   deleted: (on b6 b7) (clear b6) (arm-empty)
   added: (holding b6) (clear b7)
   goals met: 1 of 2
2. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 2
3. (unstack b7 b4)
   deleted: (on b7 b4) (clear b7) (arm-empty)
   added: (holding b7) (clear b4)
   goals met: 1 of 2
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 2
5. (unstack b4 b19)
   deleted: (on b4 b19) (clear b4) (arm-empty)
   added: (holding b4) (clear b19)
   goals met: 1 of 2
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 1 of 2
7. (unstack b19 b11)
   deleted: (on b19 b11) (clear b19) (arm-empty)
   added: (holding b19) (clear b11)
   goals met: 1 of 2
8. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 2
9. (unstack b16 b25)
   deleted: (on b16 b25) (clear b16) (arm-empty)
   added: (holding b16) (clear b25)
   goals met: 1 of 2
10. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 2
11. (unstack b25 b9)
   deleted: (on b25 b9) (clear b25) (arm-empty)
   added: (holding b25) (clear b9)
   goals met: 1 of 2
12. (stack b25 b11)
   deleted: (clear b11) (holding b25)
   added: (arm-empty) (clear b25) (on b25 b11)
   goals met: 2 of 2
